Repository: emmalexander/resume_app
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr

# language
source: English
de: Deutsch
es: Español
fr: Français

source: Socials
de: Sozial
es: Social
fr: Sociaux

source: Developer
de: Entwickler
es: Desarrollador
fr: Développeur

# careerHeading
source: What I can do for you?
de: Was kann ich für Dich tun?
es: ¿Qué puedo hacer por ti?
fr: Ce que je peux faire pour toi?

# canDo1
source: Building application user interfaces (UIs) to provide mobile functionality with Flutter.
de: Erstellen von Benutzeroberflächen (UI) für Anwendungen, um mobile Funktionen mit Flutter bereitzustellen.
es: Creación de interfaces de usuario (UI) de aplicaciones para proporcionar funcionalidad móvil con Flutter.
fr: Création d'interfaces utilisateur (UI) d'application pour fournir des fonctionnalités mobiles avec Flutter.

# canDo2
source: Keeping up to date with the vocabulary, concepts, and best practices for coding mobile apps discussing the client's requirements and the proposed solution with colleagues.
de: Halten Sie sich über Vokabular, Konzepte und Best Practices für die Codierung mobiler Anwendungen auf dem Laufenden, indem Sie Kundenanforderungen und Lösungsvorschläge mit Kollegen besprechen.
es: Manténgase al tanto del vocabulario, los conceptos y las mejores prácticas para codificar aplicaciones móviles discutiendo los requisitos del cliente y la solución propuesta con colegas.
fr: Se tenir au courant du vocabulaire, des concepts et des meilleures pratiques pour coder des applications mobiles en discutant des exigences du client et de la solution proposée avec des collègues.

# canDo3
source: Adapting and repurposing current online applications for mobile applications.
de: Aktuelle Online-Anwendungen für mobile Anwendungen anpassen und neu ausrichten.
es: Adaptar y reorientar aplicaciones online actuales para aplicaciones móviles.
fr: Adapter et réorienter les applications en ligne actuelles pour les applications mobiles.

# canDo4
source: Experience with MVC frameworks, REST/RPC API design and development.
de: Erfahrung mit MVC-Frameworks, REST/RPC-API-Design und -Entwicklung.
es: Experiencia con frameworks MVC, diseño y desarrollo de API REST/RPC.
fr: Expérience avec les frameworks MVC, la conception et le développement d'API REST/RPC.

# canDo5
source: Experience in communicating with users, other technical teams, and management to collect requirements, describe software product features, and technical designs.
de: Erfahrung in der Kommunikation mit Benutzern, anderen technischen Teams und dem Management, um Anforderungen zu sammeln, Softwareproduktfunktionen und technische Designs zu beschreiben.
es: Experiencia comunicándose con usuarios, otros equipos técnicos y administración para recopilar requisitos, describir características de productos de software y diseños técnicos.
fr: Expérience de la communication avec les utilisateurs, d'autres équipes techniques et la direction pour collecter les exigences, décrire les fonctionnalités des produits logiciels et les conceptions techniques.

# canDo6
source: Ability to take a project from scoping requirements through actual launch of the project.
de: Fähigkeit, ein Projekt von den Scoping-Anforderungen zum tatsächlichen Projektstart zu verschieben.
es: Capacidad para mover un proyecto desde los requisitos de alcance hasta el lanzamiento real del proyecto.
fr: Capacité à faire passer un projet des exigences de cadrage au lancement effectif du projet.

source: Education
de: Ausbildung
es: Educación
fr: Éducation

# higherEducation
source: Bachelor of Engineering from the University of
de: Bachelor of Engineering an der Universität von
es: Licenciado en Ingeniería por la Universidad de
fr: Baccalauréat en génie de l'Université de

# date1
source: Oct 2015 - Sept 2021
de: Oktober 2015 - September 2021
es: Octubre 2015 - Septiembre 2021
fr: octobre 2015 - septembre 2021

# date2
source: Oct 2010 - May 2015
de: Oktober 2010 - Mai 2015
es: Octubre 2010 - Mayo 2015
fr: octobre 2010 - mai 2015

# date3
source: Oct 2005 - Sept 2010
de: Oktober 2005 - September 2010
es: Octubre 2005 - Septiembre 2010
fr: octobre 2005 - septembre 2010

# themeLight
source: Light
de: Licht
es: Luz
fr: Lumière

# themeDark
source: Dark
de: Dunkel
es: Oscuro
fr: Sombre

# themeSystem
source: System
es: Sistema
fr: Système

source: Personal
de: persönlich
fr: Personnel

source: Career
de: Karriere
es: Carrera profesional
fr: Carrière
